nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/sqi/processor/sqi_p32mz2048ech064.h
PLIB_INLINE_API bool PLIB_SQI_ExistsTransferCommand(SQI_MODULE_ID index)
{
     return SQI_ExistsTransferCommand_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_ByteCountSet(SQI_MODULE_ID index, uint16_t xferCount)
{
     SQI_ByteCountSet_Default(index, xferCount);
}

PLIB_INLINE_API uint16_t PLIB_SQI_ByteCountGet(SQI_MODULE_ID index)
{
     return SQI_ByteCountGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsTransferCount(SQI_MODULE_ID index)
{
     return SQI_ExistsTransferCount_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_ControlWordSet(SQI_MODULE_ID index, bool csDeassert, SQI_CS_NUM csNum, SQI_LANE_MODE laneMode, SQI_XFER_CMD command, uint16_t xferCount)
{
     SQI_ControlWordSet_Default(index, csDeassert, csNum, laneMode, command, xferCount);
}

PLIB_INLINE_API uint32_t PLIB_SQI_ControlWordGet(SQI_MODULE_ID index)
{
     return SQI_ControlWordGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsControlWord(SQI_MODULE_ID index)
{
     return SQI_ExistsControlWord_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_ClockDividerSet(SQI_MODULE_ID index, SQI_CLK_DIV clkDivider)
{
     SQI_ClockDividerSet_Default(index, clkDivider);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsClockDivider(SQI_MODULE_ID index)
{
     return SQI_ExistsClockDivider_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ClockIsStable(SQI_MODULE_ID index)
{
     return SQI_ClockIsStable_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsClockReady(SQI_MODULE_ID index)
{
     return SQI_ExistsClockReady_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_ClockEnable(SQI_MODULE_ID index)
{
     SQI_ClockEnable_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_ClockDisable(SQI_MODULE_ID index)
{
     SQI_ClockDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsClockControl(SQI_MODULE_ID index)
{
     return SQI_ExistsClockControl_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_RxBufferThresholdSet(SQI_MODULE_ID index, uint8_t threshold)
{
     SQI_RxBufferThresholdSet_Default(index, threshold);
}

PLIB_INLINE_API uint8_t PLIB_SQI_RxBufferThresholdGet(SQI_MODULE_ID index)
{
     return SQI_RxBufferThresholdGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsRxBufThreshold(SQI_MODULE_ID index)
{
     return SQI_ExistsRxBufThreshold_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_TxBufferThresholdSet(SQI_MODULE_ID index, uint8_t threshold)
{
     SQI_TxBufferThresholdSet_Default(index, threshold);
}

PLIB_INLINE_API uint8_t PLIB_SQI_TxBufferThresholdGet(SQI_MODULE_ID index)
{
     return SQI_TxBufferThresholdGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsTxBufThreshold(SQI_MODULE_ID index)
{
     return SQI_ExistsTxBufThreshold_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_RxBufferThresholdIntSet(SQI_MODULE_ID index, uint8_t threshold)
{
     SQI_RxBufferThresholdIntSet_Default(index, threshold);
}

PLIB_INLINE_API uint8_t PLIB_SQI_RxBufferThresholdIntGet(SQI_MODULE_ID index)
{
     return SQI_RxBufferThresholdIntGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsRxBufIntThreshold(SQI_MODULE_ID index)
{
     return SQI_ExistsRxBufIntThreshold_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_TxBufferThresholdIntSet(SQI_MODULE_ID index, uint8_t threshold)
{
     SQI_TxBufferThresholdIntSet_Default(index, threshold);
}

PLIB_INLINE_API uint8_t PLIB_SQI_TxBufferThresholdIntGet(SQI_MODULE_ID index)
{
     return SQI_TxBufferThresholdIntGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsTxBufIntThreshold(SQI_MODULE_ID index)
{
     return SQI_ExistsTxBufIntThreshold_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_InterruptEnable(SQI_MODULE_ID index, SQI_INTERRUPTS interruptFlag)
{
     SQI_InterruptEnable_Default(index, interruptFlag);
}

PLIB_INLINE_API void PLIB_SQI_InterruptDisable(SQI_MODULE_ID index, SQI_INTERRUPTS interruptFlag)
{
     SQI_InterruptDisable_Default(index, interruptFlag);
}

PLIB_INLINE_API void PLIB_SQI_InterruptDisableAll(SQI_MODULE_ID index)
{
     SQI_InterruptDisableAll_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_InterruptIsEnabled(SQI_MODULE_ID index, SQI_INTERRUPTS interruptFlag)
{
     return SQI_InterruptIsEnabled_Default(index, interruptFlag);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsInterruptControl(SQI_MODULE_ID index)
{
     return SQI_ExistsInterruptControl_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_InterruptFlagGet(SQI_MODULE_ID index, SQI_INTERRUPTS interruptFlag)
{
     return SQI_InterruptFlagGet_Default(index, interruptFlag);
}

PLIB_INLINE_API uint32_t PLIB_SQI_InterruptWordGet(SQI_MODULE_ID index)
{
     return SQI_InterruptWordGet_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_InterruptWordClear(SQI_MODULE_ID index, uint32_t flags)
{
     SQI_InterruptWordClear_Default(index, flags);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsInterruptStatus(SQI_MODULE_ID index)
{
     return SQI_ExistsInterruptStatus_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_TransmitData(SQI_MODULE_ID index, uint32_t data)
{
     SQI_TransmitData_Default(index, data);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsTxData(SQI_MODULE_ID index)
{
     return SQI_ExistsTxData_Default(index);
}

PLIB_INLINE_API uint32_t PLIB_SQI_ReceiveData(SQI_MODULE_ID index)
{
     return SQI_ReceiveData_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsRxData(SQI_MODULE_ID index)
{
     return SQI_ExistsRxData_Default(index);
}

PLIB_INLINE_API uint8_t PLIB_SQI_TransmitBufferFreeSpaceGet(SQI_MODULE_ID index)
{
     return SQI_TransmitBufferFreeSpaceGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsTxBufferFree(SQI_MODULE_ID index)
{
     return SQI_ExistsTxBufferFree_Default(index);
}

PLIB_INLINE_API uint8_t PLIB_SQI_NumberOfReceiveBufferReads(SQI_MODULE_ID index)
{
     return SQI_NumberOfReceiveBufferReads_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsRxBufferCount(SQI_MODULE_ID index)
{
     return SQI_ExistsRxBufferCount_Default(index);
}

PLIB_INLINE_API uint8_t _PLIB_UNSUPPORTED PLIB_SQI_ConBufWordsAvailable(SQI_MODULE_ID index)
{
     return SQI_ConBufWordsAvailable_Unsupported(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsConBufAvailable(SQI_MODULE_ID index)
{
     return SQI_ExistsConBufAvailable_Unsupported(index);
}

PLIB_INLINE_API uint8_t _PLIB_UNSUPPORTED PLIB_SQI_CommandStatusGet(SQI_MODULE_ID index)
{
     return SQI_CommandStatusGet_Unsupported(index);
}

